In [42]:
import pandas as pd

# Load the obesity rating data
obesity_df = pd.read_csv('./dsa-airflow/data/obesity_rating.csv', header=0)
display(obesity_df.head(5))

   OBJECTID        NAME  Obesity   Shape__Area  Shape__Length
0         1       Texas     32.4  7.672329e+12   1.540832e+07
1         2  California     24.2  5.327809e+12   1.451870e+07
2         3    Kentucky     34.6  1.128830e+12   6.346699e+06
3         4     Georgia     30.7  1.652980e+12   5.795596e+06
4         5   Wisconsin     30.7  1.567816e+12   6.806782e+06

In [43]:
# Clean the data
# Make sure Area is a float
obesity_df['Shape__Area'] = obesity_df['Shape__Area'].astype(float)
#display(obesity_df.dtypes)

# Convert the area from square feet to square miles
obesity_df['Shape__Area'] = obesity_df['Shape__Area'].div(27878400)
# Rename the necessary columns
obesity_df.rename(columns={'Shape__Area': 'area_sq_mi', 'Obesity': 'obesity_percentage', 'NAME': 'state'}, inplace=True)
# Drop the unnecessary columns
obesity_df.drop(columns=['OBJECTID', 'Shape__Length'], inplace=True)

display(obesity_df.head(5))

        state  obesity_percentage     area_sq_mi
0       Texas                32.4  275206.942338
1  California                24.2  191108.866196
2    Kentucky                34.6   40491.214926
3     Georgia                30.7   59292.508963
4   Wisconsin                30.7   56237.664084

In [44]:
# Added the state abbreviations using a list
abbrev_list = ['TX', 'CA', 'KY', 'GA', 'WI', 'OR', 'VA', 'TN', 'LA', 'NY',
               'MI', 'ID', 'FL', 'AK', 'MT', 'MN', 'NE', 'WA', 'OH', 'IL',
               'MO', 'IA', 'SD', 'AR', 'MS', 'CO', 'NC', 'UT', 'OK', 'WY',
               'WV', 'IN', 'MA', 'NV', 'CT', 'DC', 'RI', 'AL', 'PR', 'SC',
               'ME', 'HI', 'AZ', 'NM', 'MD', 'DE', 'PA', 'KS', 'VT', 'NJ',
               'ND', 'NH']
obesity_df['state_abbrev'] = abbrev_list
display(obesity_df.tail(5))
# Make sure the data types are correct
display(obesity_df.dtypes)

            state  obesity_percentage    area_sq_mi state_abbrev
47         Kansas                34.2  83949.075858           KS
48        Vermont                25.1  10005.284745           VT
49     New Jersey                25.6   8056.651297           NJ
50   North Dakota                31.0  72211.883297           ND
51  New Hampshire                26.3   9703.907084           NH

state                  object
obesity_percentage    float64
area_sq_mi            float64
state_abbrev           object
dtype: object

In [45]:
# Load the cleaned obesity rating data into new CSV file
obesity_df.to_csv('./dsa-airflow/data/obesity_rating_cleaned.csv', index=False)

In [21]:
# Load the subway stores data
subway_df = pd.read_csv('./dsa-airflow/data/subway_stores.csv', header=0)
display(subway_df.head(5))

,index,name,url,street_address,city,state,zip_code,country,phone_number_1,phone_number_2,...,email_2,website,open_hours,latitude,longitude,facebook,twitter,instagram,pinterest,youtube
0,0,Subway,http://order.subway.com/Stores/Redirect.aspx?s...,"1800 Duke St, Ste 100",Alexandria,VA,22314,USA,NaN,NaN,...,NaN,NaN,"Monday 7:00 AM - 7:00 PM, Tuesday 7:00 AM - 7:...",38.8043,-77.0611,NaN,NaN,NaN,NaN,NaN
1,1,Subway,http://order.subway.com/Stores/Redirect.aspx?s...,"1512 King St,",Alexandria,VA,22301,USA,NaN,NaN,...,NaN,NaN,"Sunday 9:00 AM - 8:00 PM, Monday 7:00 AM - 9:0...",38.8062,-77.0565,NaN,NaN,NaN,NaN,NaN
2,2,Subway,http://order.subway.com/Stores/Redirect.aspx?s...,"2361 Eisenhower Ave,",Alexandria,VA,22314,USA,NaN,NaN,...,NaN,NaN,"Sunday 9:00 AM - 8:30 PM, Monday 6:30 AM - 9:0...",38.8012,-77.0691,NaN,NaN,NaN,NaN,NaN
3,3,Subway,http://order.subway.com/Stores/Redirect.aspx?s...,"320 King Street, 1st Floor",Alexandria,VA,22314,USA,NaN,NaN,...,NaN,NaN,"Sunday 9:00 AM - 8:00 PM, Monday 7:00 AM - 9:0...",38.8045,-77.0433,NaN,NaN,NaN,NaN,NaN
4,4,Subway,http://order.subway.com/Stores/Redirect.aspx?s...,"5836 N. Kings Hwy, Suite A, Huntington Station",Alexandria,VA,22303,USA,NaN,NaN,...,NaN,NaN,"Sunday 9:00 AM - 9:00 PM, Monday 7:00 AM - 10:...",38.7903,-77.0769,NaN,NaN,NaN,NaN,NaN

In [33]:
# Select all columns we need and drop the rest
subway_df = subway_df[['name', 'street_address', 'city', 'state', 'zip_code', 'country', 'latitude', 'longitude']]
#display(subway_df.duplicated().sum())
#display(subway_df.info())

# Clean the data
subway_df.drop_duplicates(inplace=True)
subway_df.dropna(inplace=True)
subway_df.reset_index(drop=True, inplace=True)

#display(subway_df.info())
display(subway_df.head(5))

,name,street_address,city,state,zip_code,country,latitude,longitude
0,Subway,"1800 Duke St, Ste 100",Alexandria,VA,22314,USA,38.8043,-77.0611
1,Subway,"1512 King St,",Alexandria,VA,22301,USA,38.8062,-77.0565
2,Subway,"2361 Eisenhower Ave,",Alexandria,VA,22314,USA,38.8012,-77.0691
3,Subway,"320 King Street, 1st Floor",Alexandria,VA,22314,USA,38.8045,-77.0433
4,Subway,"5836 N. Kings Hwy, Suite A, Huntington Station",Alexandria,VA,22303,USA,38.7903,-77.0769

In [34]:
# Load the cleaned subway stores data into new CSV file
subway_df.to_csv('./dsa-airflow/data/subway_stores_cleaned.csv', index=False)

In [38]:
# Load the chipotle stores data
chipotle_df = pd.read_csv('./dsa-airflow/data/chipotle_stores.csv', header=0)
display(chipotle_df.info())
display(chipotle_df.head(5))

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2629 entries, 0 to 2628
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   state      2629 non-null   object
 1   location   2629 non-null   object
 2   address    2629 non-null   object
 3   latitude   2629 non-null   float64
 4   longitude  2629 non-null   float64
dtypes: float64(2), object(3)
memory usage: 102.8+ KB

None

,state,location,address,latitude,longitude
0,Alabama,Auburn,"346 W Magnolia Ave Auburn, AL 36832 US",32.606813,-85.487328
1,Alabama,Birmingham,"300 20th St S Birmingham, AL 35233 US",33.509721,-86.802756
2,Alabama,Birmingham,"3220 Morrow Rd Birmingham, AL 35235 US",33.595581,-86.647437
3,Alabama,Birmingham,"4719 Highway 280 Birmingham, AL 35242 US",33.422582,-86.698279
4,Alabama,Cullman,"1821 Cherokee Ave SW Cullman, AL 35055 US",34.154134,-86.841220

In [39]:
# Clean the data (this data was already pretty clean, but we will do it again for practice)
chipotle_df.drop_duplicates(inplace=True)
chipotle_df.dropna(inplace=True)
chipotle_df.reset_index(drop=True, inplace=True)
display(chipotle_df.info())
display(chipotle_df.head(5))

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2629 entries, 0 to 2628
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   state      2629 non-null   object
 1   location   2629 non-null   object
 2   address    2629 non-null   object
 3   latitude   2629 non-null   float64
 4   longitude  2629 non-null   float64
dtypes: float64(2), object(3)
memory usage: 102.8+ KB

None

,state,location,address,latitude,longitude
0,Alabama,Auburn,"346 W Magnolia Ave Auburn, AL 36832 US",32.606813,-85.487328
1,Alabama,Birmingham,"300 20th St S Birmingham, AL 35233 US",33.509721,-86.802756
2,Alabama,Birmingham,"3220 Morrow Rd Birmingham, AL 35235 US",33.595581,-86.647437
3,Alabama,Birmingham,"4719 Highway 280 Birmingham, AL 35242 US",33.422582,-86.698279
4,Alabama,Cullman,"1821 Cherokee Ave SW Cullman, AL 35055 US",34.154134,-86.841220

In [41]:
# Load the cleaned chipotle stores data into new CSV file
chipotle_df.to_csv('./dsa-airflow/data/chipotle_stores_cleaned.csv', index=False)